{'query': 'Can you provide the latest release notes in 2024 for mongoDB Atlas', 'chat_history': [], 'result': 'Yes, the latest release notes for MongoDB Atlas in 2024 are for version 1.15.0, which was released on February 22, 2024. This release includes several new features and enhancements, including support for managing Atlas Search nodes directly through the CLI, the ability to assign tags to projects at the time of creation, and a bug fix for the atlas clusters update command.', 'source_documents': [Document(page_content='The Atlas CLI changelog for version 1.15.0, released on February 22, 2024, introduces several signiﬁcant updates and improvements to enhance user experience and functionality. Here is an elaboration of the content provided in the changelog for this version: 1. New Features for Atlas Search Nodes Management The latest release adds comprehensive support for managing Atlas Search nodes directly through the CLI. This is a signiﬁcant enhancement for users who leverage Atlas Search for full-text search capabilities within their MongoDB clusters. The new commands introduced allow for a range of operations, making it easier for developers and database administrators to manage the search infrastructure without leaving the command line interface. The commands added include: o atlas clusters search nodes create: This command allows users to create new Atlas Search nodes within their existing cluster conﬁgurations. It facilitates the scaling of search capabilities in response to application demands. o atlas clusters search nodes list: With this command, users can list all the current Atlas Search nodes in their clusters. This is particularly useful for monitoring and auditing purposes. o atlas clusters search nodes update: This command enables the modiﬁcation of existing Atlas Search nodes. Users can adjust settings to optimize performance or to adapt to changing requirements in their search infrastructure. o atlas clusters search nodes delete: This command provides a straightforward way to remove Atlas Search nodes from a cluster. It helps in downsizing or reconﬁguring the search setup as needed. 2. Enhancement to the Atlas Projects Creation Command The update introduces the --tag ﬂag to the atlas projects create command. This new ﬂag allows users to assign tags to their projects at the time of creation. Tags are key-value pairs that serve as metadata, helping users organize, categorize, and manage their projects more eTectively within Atlas. This addition is particularly useful for large organizations or users managing multiple projects, enabling them to maintain a structured and easily navigable project landscape. 3. Bug Fix Version 1.15.0 addresses and resolves a previously identiﬁed bug that aTected the atlas clusters update command. Prior to this release, users encountered issues when attempting to use the --ﬁle ﬂag with this command. The --ﬁle ﬂag is intended to allow users to update cluster conﬁgurations using a ﬁle containing the desired settings. This bug ﬁx ensures that users can now smoothly apply updates to their clusters using a conﬁguration ﬁle, streamlining the process and minimizing the potential for manual errors. Overall, the Atlas CLI version 1.15.0 release brings about signiﬁcant enhancements and ﬁxes that improve the user experience, particularly for those managing Atlas Search nodes and projects. These updates reﬂect ongoing eTorts to provide a robust, user-friendly command-line interface for MongoDB Atlas users, facilitating eTicient management of their cloud database environments.', metadata={'page': 0, 'source': '/Users/DPRABAK7/Downloads/Mongodb_MongoDB test2.pdf'}), Document(page_content='The Atlas CLI changelog for version 1.15.0, released on February 22, 2024, introduces several signiﬁcant updates and improvements to enhance user experience and functionality. Here is an elaboration of the content provided in the changelog for this version: 1. New Features for Atlas Search Nodes Management The latest release adds comprehensive support for managing Atlas Search nodes directly through the CLI. This is a signiﬁcant enhancement for users who leverage Atlas Search for full-text search capabilities within their MongoDB clusters. The new commands introduced allow for a range of operations, making it easier for developers and database administrators to manage the search infrastructure without leaving the command line interface. The commands added include: o atlas clusters search nodes create: This command allows users to create new Atlas Search nodes within their existing cluster conﬁgurations. It facilitates the scaling of search capabilities in response to application demands. o atlas clusters search nodes list: With this command, users can list all the current Atlas Search nodes in their clusters. This is particularly useful for monitoring and auditing purposes. o atlas clusters search nodes update: This command enables the modiﬁcation of existing Atlas Search nodes. Users can adjust settings to optimize performance or to adapt to changing requirements in their search infrastructure. o atlas clusters search nodes delete: This command provides a straightforward way to remove Atlas Search nodes from a cluster. It helps in downsizing or reconﬁguring the search setup as needed. 2. Enhancement to the Atlas Projects Creation Command The update introduces the --tag ﬂag to the atlas projects create command. This new ﬂag allows users to assign tags to their projects at the time of creation. Tags are key-value pairs that serve as metadata, helping users organize, categorize, and manage their projects more eTectively within Atlas. This addition is particularly useful for large organizations or users managing multiple projects, enabling them to maintain a structured and easily navigable project landscape. 3. Bug Fix Version 1.15.0 addresses and resolves a previously identiﬁed bug that aTected the atlas clusters update command. Prior to this release, users encountered issues when attempting to use the --ﬁle ﬂag with this command. The --ﬁle ﬂag is intended to allow users to update cluster conﬁgurations using a ﬁle containing the desired settings. This bug ﬁx ensures that users can now smoothly apply updates to their clusters using a conﬁguration ﬁle, streamlining the process and minimizing the potential for manual errors. Overall, the Atlas CLI version 1.15.0 release brings about signiﬁcant enhancements and ﬁxes that improve the user experience, particularly for those managing Atlas Search nodes and projects. These updates reﬂect ongoing eTorts to provide a robust, user-friendly command-line interface for MongoDB Atlas users, facilitating eTicient management of their cloud database environments.', metadata={'page': 0, 'source': '/Users/DPRABAK7/Downloads/Mongodb_MongoDB test2.pdf'})]}